CREATE TABLE T_USER(
 USER_ID varchar(16) PRIMARY KEY, -- ユーザID
 ACCOUNT_NAME varchar(32) NOT NULL, -- ユーザ名
 USER_PASS varchar(16) NOT NULL, -- パスワード
 urole int -- ユーザ種別 1-社員 2-ゲスト

);

INSERT INTO T_USER VALUES
('u001','渡部 妃菜', '1234',1),
('u002','安田 敬太', '1234',1),
('u003','前田 稟',   '1234',1),
('u004','山本 明莉', '1234',1),
('u005','斉藤 万葉', '1234',1),
('u006','高野 歩',   '1234',1),
('u007','尾崎 沙織', '1234',1),
('u008','菅原 直子', '1234',1),
('u009','大島 ゆら',  '1234',1),
('u010','中西 陽花', '1234',1),
('t001', 'ゲスト1',   '3456',2),
('t002', 'ゲスト2',   '3456',2),
('t003', 'ゲスト3',   '3456',2),
('t004', 'ゲスト4',   '3456',2),
('t005', 'ゲスト5',   '3456',2);

CREATE TABLE T_RSTINFO(
 STORE_ID VARCHAR(32) PRIMARY KEY,
 STORE_NAME VARCHAR(32) NOT NULL,
 ADDRESS VARCHAR(64) NOT NULL,
 OP_HOUR INT(10),
 OP_MIN INT(10),
 CL_HOUR INT(10),
 CL_MIN INT(10),
 MOVE_TIME INT(10),
 HOLIDAY INT(10),
 HP_URL VARCHAR(256),
 EVALUATION FLOAT(2) NOT NULL,
 USER_ID VARCHAR(16)
);

INSERT INTO T_RSTINFO VALUES
('r001','ファミレス','福岡県福岡市',9,8,7,6,4,2,'NULL',3,'NULL');

CREATE TABLE T_REVIEW(
 REVIEW_ID VARCHAR(32) PRIMARY KEY,
 EVALUATION_POINTS INT(1) NOT NULL,
 COMMENT VARCHAR(400) NOT NULL,
 USER_ID VARCHAR(8) NOT NULL,
 STORE_ID VARCHAR(32) NOT NULL
);

INSERT INTO T_REVIEW VALUES
('11937_5d3148a9875fc',2,"量が少ない","u008","16883_5d27fe8d712bb"),
('12967_5d31369012756',3,"おいしかった","u001","27923_5d2809201dfe7"),
('1308_5d31445376543',3,"おいしかった","u007","27973_5d2b624e863d2"),
('1342_5d31391143870',5,"安くておいしいです","u003","20777_5d28083e6a7fa"),
('14154_5d313b33f1a90',4,"安くておいしいです","u003","30113_5d273a9896"),
('14830_5d31441f5ccd5',4,"おいしかった","u007","16883_5d27fe8d712bb"),
('14832_5d314352d3e10',4,"メニューがたくさんあっていい感じ","u006","29450_5d20caaf3b"),
('15297_5d313670f376f',4,"おいしかった","u001","16883_5d27fe8d712bb"),
('18107_5d313cdfe5145',4,"安くておいしいです","u003","29040_5d25a1db86"),
('18392_5d313f2ac7981',4,"おいしかったです","u004","16883_5d27fe8d712bb"),
('20383_5d31393a68f4d',3,"安くておいしいです","u003","16883_5d27fe8d712bb"),
('21043_5d3142e1cbec4',5,"メニューがたくさんあっていい感じ","u006","16883_5d27fe8d712bb"),
('21059_5d3137d2c6d7e',3,"ヘルシー料理多めだから女性におすすめ","u002","29040_5d25a1db86"),
('21245_5d313751c966f',4,"おいしかった","u001","r001"),
('22280_5d31485694c91',3,"もっといろんなメニューがあるといい","u001","16883_5d27fe8d712bb"),
('2284_5d313956510ec',4,"安くておいしいです","u003","27973_5d2b624e863d2"),
('23476_5d314979e7902',4,"手軽に食べられるものがほしい","u009","29450_5d20caaf3b"),
('24207_5d314440d07d1',4,"おいしかった","u007","20777_5d28083e6a7fa"),
('2436_5d31401fc88b6',2,"まあまあかな もう少し店がきれいだったら．．．","u005","16883_5d27fe8d712bb"),
('25781_5d313b18b3fc3',4,"安くておいしいです","u003","27923_5d2809201dfe7"),
('25893_5d31458640ba8',4,"おいしかった","u007","7018_5d2b5eb5e8315"),
('26018_5d3140dee484e',3,"まあまあかな","u005","29040_5d25a1db86"),
('28518_5d3136817bbd5',3,"おいしかった","u001","20729_5d26f37521"),
('30061_5d314061a66cf',2,"まあまあかな もう少し店がきれいだったら．．．","u005","29450_5d20caaf3b"),
('31165_5d314996b7587',4,"もっとがっつり食べたい","u010","16883_5d27fe8d712bb");


CREATE TABLE T_USERTYPE(
 USER_TYPE_ID VARCHAR(16) PRIMARY KEY,
 USER_TYPE VARCHAR(20) NOT NULL
);


